{"title": "RESEARCH", "date": "Jan 1, 1957", "summary": "Defending U.S. Interests Against Malign Information Operations RESEARCH Understanding and Countering China's Maritime Gray Zone Operations RESEARCH SUMMARY Acquiring Generative Artificial Intelligence for U.S. Department of Defense Influence Activities Generative artificial intelligence has the potential to improve U.S. Department of Defense influence activities in a number of ways, but it is a tool, not a panacea. Maximizing its potential will take dedicated effort and acquisition innovation. RESEARCH Acquiring Generative Artificial Intelligence to Improve U.S. Department of Defense Influence Activities The authors review current U.S. Department of Defense generative artificial intelligence acquisition efforts (focusing on influence activities) and provide recommendations for cost-effective acquisition and development. TOOL Littoral Crisis and Conflict: A Scenario for the Information Warfighter Exercise Wargame This scenario document is a companion to the previously published rulebook for the Information Warfighter Exercise Wargame. The scenario is intended as a resource for anyone considering administering an Information Warfighter Exercise Wargame. RESEARCH Defending American Interests Abroad: Early Detection of Foreign Malign Information Operations This report describes the authors' efforts to use large language models to detect the use of classical propaganda techniques in hundreds of articles published by overseas media outlets. RESEARCH Understanding and Countering China's Maritime Gray Zone Operations The authors identify approaches for the U.S. Indo-Pacific Command to counter Chinese maritime gray zone operations, which China uses to take control of large portions of the South China Sea while avoiding a conventional U.S. military response. 2/12 https://www.rand.org/topics/information-operations.html?rows=48#topicLandingPageList-1165855063-form 10/13/25, 2:52 PM Information Operations | RAND RESEARCH How the United States Can Support Allied and Partner Efforts to Counter China in the Gray Zone: Affirmative Engagement This report summarizes the tactics and approaches taken by several countries in Southeast and East Asia — Indonesia, Japan, Malaysia, the Philippines, Taiwan, and Vietnam — in response to China's coercive actions in the gray zone. RESEARCH Scaling Non-Kinetic Capability Integration in the Information Age This report presents an examination of ways the Department of the Air Force can develop, employ, and integrate non kinetic capabilities intended to influence adversaries and other actors in competition and conflict. VIDEO Generative AI's Potential Role in Information Warfare To understand the potential implications that generative artificial intelligence (AI) might have for social media manipulation, RAND experts consider a case study: how the Chinese military may adopt generative AI to interfere in Taiwan's democracy. COMMENTARY A Different Kind of Disaster Response: Using Social Media Best Practices to Stem the Tide of Misinformation Engaging on social media is a different type of disaster response than clearing debris and delivering clean water. Stemming the tide of online misinformation is challenging but critical to combat the rumor mill. RESEARCH Dr. Li Bicheng, or How China Learned to Stop Worrying and Love Social Media Manipulation: Insights Into Chinese Use of Generative AI and Social Bots from the Career of a PLA Researcher The Chinese Communist Party has come to embrace social media as a way to influence domestic and foreign public opinion, both overtly and covertly. This report examines China’s approach to cyber-enabled influence operations. 3/12 https://www.rand.org/topics/information-operations.html?rows=48#topicLandingPageList-1165855063-form 10/13/25, 2:52 PM Information Operations | RAND COMMENTARY The Kursk Offensive: Triumph or Tragedy in the Making? Ukraine's Kursk operation is potentially a game-changing move. But it could lead to escalation, including increased Russian use of chemical weapons. COMMENTARY Disinformation May Thrive as Transparency Deteriorates Across Social Media What can be done to confront disinformation in an environment where content moderation is increasingly viewed as overly partisan and social media transparency has declined? Educating the public on disinformation tactics could help, though concerns about politicization persist. COMMENTARY Ukraine's Kursk Incursion: Another Nail in the Coffin of Putin's Regime? Ukraine's bold Kursk operation challenges Putin's war narrative and exposes domestic vulnerabilities. While unlikely to collapse Putin's regime, the symbolic impact of Ukrainian advances into Russian territory erodes its foundation and boosts Ukraine's resolve. COMMENTARY Ukraine May Be Winning the Information War in Kursk Ukraine's Kursk offensive has the potential to positively influence Western perceptions, sustain funding and material support for Ukraine, and degrade Russian domestic support for the war. This strategic gamble in the information space might pay off. COMMENTARY Spick and Span: How North Korea's Clean Streets Sanitize Its Image Abroad Visitors to Pyongyang often marvel at its clean streets. This fascination highlights the regime's success in controlling the narrative and presenting an image of efficiency and purity to the outside world. But outside the capital, many areas face poor sanitation and infrastructure, revealing a stark contrast. 4/12 https://www.rand.org/topics/information-operations.html?rows=48#topicLandingPageList-1165855063-form 10/13/25, 2:52 PM Information Operations | RAND RESEARCH Ukrainian Resistance to Russian Disinformation: Lessons for Future Conflict In this report, the authors provide an overview of Ukrainian efforts to counter Russia's disinformation war and identify relevant lessons for the United States and allied militaries. ARTICLE Social Media Manipulation in the Era of AI AI has opened a potential propaganda gold mine. Large language models like ChatGPT can learn to mimic human speech. They can respond to jokes and cultural references and engage users in debates. Social media platforms should redouble their efforts to identify, attribute, and remove fake accounts. RESEARCH the Implications of Global Trends over the thinking beyond the immediate challenges Australia faces at home and in the Indo-Pacific region. Implications from numerous megatrends are presented to inform future defence planning. COMMENTARY Rampant Nationalism Is Undermining China's 'Three Warfares' China has invested a fortune in influence operations to shape its national image and sway international public opinion in its favor. Yet grassroots Chinese nationalists are diminishing the return on Beijing's investment. COMMENTARY Russia's Post-War Military Recruiting Strategy Emerges Russia's military recruiting efforts generally include offering higher wages and benefits, tightly managing public engagement and perceptions of the war to suppress bad news, and increasing military–patriotic education in schools to target the next generation of recruits. 5/12 https://www.rand.org/topics/information-operations.html?rows=48#topicLandingPageList-1165855063-form 10/13/25, 2:52 PM Information Operations | RAND COMMENTARY Why the Decline of Local Media Could Be a Security Risk The decline of local media in the United States creates vulnerabilities to adversarial influence. Supporting local journalism is essential for strengthening democracy and ensuring timely detection of security threats. COMMENTARY Fueled by New Attacks, the Houthi Information Campaign Is Thriving Despite U.S.-led coalition efforts to curb their aggression, the Houthis' adept use of propaganda and low-cost technology has allowed them to continue their attacks and gain regional support. Attacks will persist as long as they see benefits. A U.S. counterinformation campaign could substantially reduce those benefits. RESEARCH Operationalizing U.S. Air Force Information Warfare Although U.S. Air Force leaders have recognized the importance of information warfare (IW), the service's approach to conducting IW remains nascent. This report provides recommendations for how the service should organize, train, and equip for IW. COMMENTARY Black Americans Aren't Buying Election-Year Falsehoods. Here's Why. widespread election and voter fraud than their white counterparts did. What lessons can be learned from Black Americans' resilience to disinformation? COMMENTARY Equipping the Japan-U.S. Alliance to Handle China's Disinformation Operations China's disinformation is dangerous. Just as the Japan-U.S. alliance has strengthened to enable a more robust deterrence against possible kinetic action, so too should the allies consider ways to strengthen their collective ability to respond to disinformation operations. 6/12 https://www.rand.org/topics/information-operations.html?rows=48#topicLandingPageList-1165855063-form 10/13/25, 2:52 PM Information Operations | RAND RESEARCH Cognitive Domain Operations Against Vietnam Hint at Broader Ambitions The People's Liberation Army (PLA) is updating and expanding its efforts to target countries with cyber-enabled Influence Operations. It is already planning for IO against Vietnam, while similar efforts are likely underway against Burma and India. COMMENTARY Winning the Balloon Wars: How Airborne Information Could Prod Kim to Rein in His Nuclear Ambitions The threat of an ongoing information campaign that relies on balloon drops, followed by the use of other technologies, could help prod Kim Jong-un to step back from immediate plans, such as another nuclear test, and to rethink his overall nuclear ambitions. RESEARCH Organizing for Information Warfare at the Geographic Combatant Commands: Lessons from the United States Central Command Joint Effects Process This report documents the planning processes used at U.S. information into its battle rhythm. It includes an assessment, lessons, and a framework for future learning. DATA VIZ A Logic Model for Intermediate Force Capabilities Intermediate force capabilities (IFCs) include non-lethal weapons, information operations, electromagnetic warfare, and cyber capabilities. A RAND-developed logic model examines IFCs, how they relate to one another, and how they contribute to strategic goals. TOOL The Information Warfighter Exercise Wargame: Second Edition — Rulebook This document presents the updated, second edition ruleset for the Information Warfighter Exercise Wargame, which is used by the Marine Corps to provide training on information capabilities and activities. 7/12 https://www.rand.org/topics/information-operations.html?rows=48#topicLandingPageList-1165855063-form 10/13/25, 2:52 PM Information Operations | RAND COMMENTARY Biden, Burisma, and Ukraine: Why Moscow's Evolving Narrative of the Crocus City Hall Terrorist Attack Matters for U.S. Elections By accusing Burisma of sponsoring terrorist attacks in Russia and insinuating that President Biden, the United States, and Western intelligence agencies are also somehow connected, Russian disinformation campaigns are actively presidential election. COMMENTARY How Would China Weaponize Disinformation Against Taiwan in a Cross-Strait Conflict? What might China's future disinformation operations against Taiwan focus on? And how can Taipei and its partners combat them? China would likely have at least five discrete audiences for disinformation operations with specific lines of effort and goals for each. COMMENTARY Assemble the Bodyguard of Lies: Strengthening U.S. Military Deception Capabilities Few aspects of warfare are as valuable as efforts to deceive adversaries. The U.S. military inevitably will face rivals who use deception to their advantage, so it should once again hone its own subterfuge skills—from the lowest levels, to gain a tactical edge, to the highest, to achieve strategic surprise. COMMENTARY Russia's Disinformation Campaign About the Moscow Terror Attack May Be Working As far-fetched as it may seem to those in the West, the Kremlin's claim that the recent terrorist attack on a Moscow concert hall was orchestrated by Ukraine and Western powers may be convincing to many Russians. For the U.S. to address and combat these claims, it is important to understand how they are framed amid broadly propagated themes, and how these could influence their potential appeal to large swaths of the Russian public. 8/12 https://www.rand.org/topics/information-operations.html?rows=48#topicLandingPageList-1165855063-form 10/13/25, 2:52 PM Information Operations | RAND RESEARCH The Future of Indo-Pacific Information Warfare: Challenges and Prospects from the Rise of AI The authors address the timely issue of AI-powered information warfare in the Indo-Pacific region and its implications for regional and global security, delving into the appropriate strategies required for an effective response. RESEARCH SUMMARY Integrating Intermediate Force Capabilities into Wargames There are challenges, but also significant potential benefits, in integrating intermediate force capabilities—a suite of systems that includes non-lethal weapons, electromagnetic warfare, cyber, and information operations—into wargames. RESEARCH SUMMARY Intermediate Force Capabilities: High-Value Options for the U.S. Military RAND researchers used metrics and vignettes to assess and illustrate the value and complementarity of intermediate force capabilities, including non-lethal weapons, information operations, electromagnetic warfare, and cyber capabilities. COMMENTARY A Foreign Government, Oprah, and Fires in Maui: The Impact of Misinformation on Community Resiliency Crises and disasters are opportunities to undermine the national unity that forms in response to tragedy: U.S. adversaries may gain an advantage when there is discord among the American public. But even if information operations are cheap for foreign governments to execute, they also can be simple to counteract effectively through routine emergency management preparedness activities. EXPERT INSIGHTS Exploring the Implications of Generative AI for Chinese Military Cyber-Enabled Influence Operations: Chinese Military Strategies, Capabilities, and Intent Testimony presented before the U.S.-China Economic and Security Review Commission at the hearing \"Current and Emerging Technologies in U.S.-China Economic and 9/12 https://www.rand.org/topics/information-operations.html?rows=48#topicLandingPageList-1165855063-form 10/13/25, 2:52 PM Information Operations | RAND RESEARCH Challenges to Achieving Information Warfare Convergence in the U.S. Air Force This report summarizes major challenges facing the U.S. Air Force as it attempts to mature information warfare forces and capabilities. COMMENTARY Deepfakes Aren't the Disinformation Threat They're Made Out to Be Concerns over generative AI too often stray into alarmism, of hypothetical dystopias where fact is indistinguishable from fiction. That has distorted the picture. To really understand deepfakes, it is better to look at how they are being used today. COMMENTARY North Korea's Satellite Launch: Part of a Bigger Problem for Kim Jong-un? to launch a reconnaissance satellite despite this launch violating multiple U.N. Security Council resolutions and despite the urging of many other countries. It may well have been a desperate move by North Korea's leader, Kim Jong un. COMMENTARY BBC's Gaza Service Demonstrates Power of Radio During Conflict Radio has long been used during conflicts to relay news and information when all other means of communication are knocked out of service. The U.S. Agency for Global Media could follow the lead of the BBC World Service and establish a pop-up station to provide safety and supply updates, emergency medical information, and news to the people in Gaza. COMMENTARY Biden Should Call China's Bluff on Elections Few in the Biden administration will be surprised to learn that Beijing is lying about its intentions and activities when it comes to influence operations. But lies, maybe even especially blatant ones, present diplomatic opportunity. https://www.rand.org/topics/information-operations.html?rows=48#topicLandingPageList-1165855063-form 10/12 10/13/25, 2:52 PM Information Operations | RAND COMMENTARY Lies, Misinformation Play Key Role in Israel Hamas Fight At the strategic level, the war in Gaza is about perception, telling a story about who is the victim and who is the aggressor. Lies, mistruths, and disinformation will play a key and continuing role in this fight. COMMENTARY Educating Academics Will Ease UK Universities' Foreign Influence Crisis Tackling China's quest for foreign technologies is tough. China exploits the very principles—openness, freedom, collaboration—that have fostered scientific breakthroughs to acquire foreign technologies. This makes it difficult to intervene without damaging these values in the process. COMMENTARY Dismantling the Disinformation Business of Chinese Influence Operations Some commercial actors benefit from involvement in Chinese influence operations. What steps could the U.S. government take to address this? RESEARCH The Nightingale Versus the Bear: What Persuasion Research Reveals About Ukraine's and Russia's Messaging on the War The authors examine influence campaigns employed by targeting each state's own people and military personnel and those targeting the adversary — to understand whether the campaigns have been persuasive. COMMENTARY The United States Isn't Ready for the New Age of AI-Fueled Disinformation Generative AI offers China and other bad actors the potential to fulfill longstanding desires to shape the global conversation. It is vital that the U.S. government and social media platforms recognize this threat and work together to address it immediately. COMMENTARY Cyber Attacks Reveal Uncomfortable Truths About U.S. Defenses Without government investments and policies to drive transparency and a clear understanding of what cybersecurity tools do, how well they work, and how securely they are built, the United States risks continuing to offer its adversaries the means to undermine its systems and, ultimately, its security. EXPERT INSIGHTS The Rise of Generative AI and the Coming Era of Social Media Manipulation 3.0: Next Generation Chinese Astroturfing and Coping with Ubiquitous AI This Perspective explores the implications that generative artificial intelligence (AI) might have for social media manipulation. The authors argue that generative AI presents a revolutionary improvement for the social media manipulation process. COMMENTARY What Are Practical Steps to Embrace the Messiness of Public-Private Collaboration in the Fight Against Botnets? Botnets are networks of computers infected with malware that an attacker controls and uses to fulfill malicious cyber activities. Decisionmakers could incorporate a complex adaptive systems perspective to assess if their organization and immediate network, as well as the overall ecosystem, are adaptable and resilient enough to respond to botnet activities. 2/12 https://www.rand.org/topics/information-operations.html?rows=48&start=48#topicLandingPageList-1165855063-form 10/13/25, 2:53 PM Information Operations | RAND RESEARCH Planning Ethical Influence Operations: A Framework for Defense Information Professionals Using the principles of necessity, effectiveness, and proportionality, the authors develop a framework for evaluating influence operations with an initial screening, conducting a full ethical risk assessment, and preparing a justification statement. COMMENTARY Why DoD Needs Greater Focus on Nonlethal Weapons, Intermediate Force Capabilities Nonlethal weapons do not entail the firing of projectiles, the detonation of explosives, or even the use of edged weapons with blades. Their effects are more subtle, though no less powerful for that. But the effects of these systems, and their impact on overall military capabilities, are often underestimated or misunderstood. COMMENTARY Truth Decay and National Security Even if the U.S. national security apparatus can operate entirely outside of politics, it remains exposed to the effects of Truth Decay—the diminishing role of facts and analysis in American public life. Little work is being done to understand how severe the impact of Truth Decay is on national security and, more importantly, how to mitigate it. COMMENTARY ChatGPT Is Creating New Risks for National Security Large language models like ChatGPT and Claude offer a wide range of beneficial applications. But there are significant risks associated with their use that demand a coordinated effort among partner nations to forge a solid, integrated defense against the threat of malign information operations. ARTICLE Truth Decay Is Putting U.S. National Security at Risk Truth Decay—the diminishing role of facts and analysis in public life—could weaken the U.S. military, costs America credibility with its allies, and calls into question the nation's ability to respond to the next big crisis. How can the United States guard against these risks? 3/12 https://www.rand.org/topics/information-operations.html?rows=48&start=48#topicLandingPageList-1165855063-form 10/13/25, 2:53 PM Information Operations | RAND RESEARCH Assessing the Impact of Diverse Intermediate Force Capabilities and Integrating Them into Wargames for the U.S. Department of Defense and NATO The authors of this report describe how to measure the impact of intermediate force capabilities (IFCs), which cause less-than-lethal effects, and how to better integrate them into wargaming, modeling, and simulation for U.S. and NATO wide forces. COMMENTARY The AI Conspiracy Theories Are Coming Artificial intelligence is a technology ready-made for conspiratorial thinking. The time to counter conspiracy theories about AI is now—before they take hold in the minds of the public. RESEARCH Chinese Next-Generation Psychological Warfare: The Military Applications of Emerging Technologies and Implications for the United States This report explores Chinese military thinking about next generation psychological warfare, with a special focus on the applications of emerging technologies and implications for the United States. COMMENTARY How Can Platforms Deal with Toxic Content? Look to Wall Street Social media has a content problem. It's not the content itself, although the list of toxic material is long. The problem is the sheer volume of content. Instead of trusting in self-regulation, the United States could use its regulation COMMENTARY Stalled in Ukraine, Kremlin Increasingly Turns to Political Theater Stymied in Ukraine, Russian President Vladimir Putin has amped up the political theater to achieve his objectives. How do we interpret Putin's statements? While no nuclear threat should be ignored, Putin's pronouncements remain in the realm of propaganda. 4/12 https://www.rand.org/topics/information-operations.html?rows=48&start=48#topicLandingPageList-1165855063-form 10/13/25, 2:53 PM Information Operations | RAND RESEARCH Reflecting on One Year of War: The Role of Non-Military Levers One year after Russia's illegal full-scale invasion of Ukraine, this article examines the role of non-military levers (e.g., diplomatic, information, economic) in the conflict so far. COMMENTARY The Ukrainian Army Is Leveraging Online Influencers. Can the U.S. Military? Much has been said about Ukraine's astounding success in the information battlefield. How might the U.S. military emulate Ukraine's success to not only help win wars, but also to address its flagging campaign to recruit new members? COMMENTARY Standing Up to Kim Jong-un's Divide-and Conquer Strategy Kim Jong-un is frightened by even the current modest flow of information into the North. He may be prepared to reduce his provocations if those threats lead to the further spread of outside information in the North. At the very least, the ROK and the United States could try such efforts. COMMENTARY The Trouble with Russian Blacklisting Analysis, informed by interactions with Russians, offers Western leaders a window into Russia. Blacklists hinder this process. With the stakes so high, much depends on experts' success in getting their analysis right. COMMENTARY Ukraine's Lessons for the Future of Hybrid Warfare A new decision-analysis approach is necessary to capture the use of disinformation in the context of hybrid warfare. Multiple tools must be integrated to help generate a robust policy response to modern hybrid threats. 5/12 https://www.rand.org/topics/information-operations.html?rows=48&start=48#topicLandingPageList-1165855063-form 10/13/25, 2:53 PM Information Operations | RAND RESEARCH Educating for Evolving Operational Domains: Cyber and Information Education in the Department of Defense and the Role of the College of Information and Cyberspace This report examines how Department of Defense educational institutions are addressing cyberspace and information education, the potential demand for this education, and how the College of Information and Cyberspace can contribute. COMMENTARY How Russia's War in Ukraine Has Impacted Its Christian Image Over the past decade, the Russian government has taken pains to present itself as a bastion of Christianity and traditional values. Since the outbreak of the war in Ukraine, however, there have been noticeable cracks in the receptivity to this messaging strategy. COMMENTARY Emerging Domestic Battery Supply Chain Should Be Wary of China's Information Ops China has a huge stake in producing lithium-ion batteries, and is not above waging disinformation campaigns against U.S. firms involved in the battery supply chain. Extraction sector companies could work with cybersecurity experts and the U.S. intelligence community to educate their executives and local governments about any foreign disinformation risks. RESEARCH The Role of Information in U.S. Concepts for Strategic Competition A detailed enumeration of activities, a synthesis of expert consensus on challenges to gray zone competition, and a dynamic menu of solutions can enhance the U.S. competitive position in the gray zone and beyond. COMMENTARY Could K-Pop Help Deter Kim Jong-un's Provocations? The United States and Republic of Korea could be more specific and creative in seeking to deter Kim Jong-un. The global popularity of K-Pop could be part of the strategy. 6/12 https://www.rand.org/topics/information-operations.html?rows=48&start=48#topicLandingPageList-1165855063-form 10/13/25, 2:53 PM Information Operations | RAND COMMENTARY Elon Musk May Have a Point About Bots on Twitter Twitter has a deep bench of engineers working for the company. They have access to trillions of data points on their over 300 million monthly active users. Why has a company this size struggled to clean up its platform? PRESS Fake RAND Report on 'Weakening Germany' A supposedly leaked RAND report about a bizarre U.S. conspiracy to “weaken Germany” is fake. COMMENTARY Debunking Russian Lies About Biolabs at Upcoming U.N. Meetings Before Russia invaded Ukraine in February, its diplomatic missions began circulating some particularly fantastical lies. It's tempting to write off such claims as cartoonish propaganda. But Russia is making similarly outrageous claims to the United Nations and other international forums. Such maneuvers could dangerously undermine international arms control agreements. RESEARCH Information Warfare: Methods to Counter Disinformation We consider the nature of disinformation and its use in the hybrid warfare domain, before examining the problem through frames of planning approach, truth theory, systems thinking, and military strategy. COMMENTARY Facebook Misinformation Is Bad Enough. The Metaverse Will Be Worse Virtual reality environments such as the metaverse will enable psychological and emotional manipulation of users at a level unimaginable in today's media. We must not wait until these technologies are fully realized to consider appropriate guardrails for them. We can reap the benefits of the metaverse while minimizing its potential for great harm. 7/12 https://www.rand.org/topics/information-operations.html?rows=48&start=48#topicLandingPageList-1165855063-form 10/13/25, 2:53 PM Information Operations | RAND RESEARCH Rivalry in the Information Sphere: Russian Conceptions of Information Confrontation Information confrontation, with historical roots in Russian (and Soviet) military thinking, is an important element of Russian military strategy. The Ukrainian experience offers insights into Russia's present-day and future use of information confrontation and hybrid warfare. RESEARCH Russian and Ukrainian Perspectives on the Concept of Information Confrontation: This volume compiles texts from leading members of the military-scientific communities in Russia and Ukraine and illustrates how decisionmakers in these countries understand and debate information weapons and information influence. COMMENTARY New Legislation May Not Be Enough to Counter Chinese Interference in British Universities There is alarming evidence of growing Chinese espionage and influence in UK universities that could threaten UK national security and academic freedoms. Three complementary initiatives could increase university researchers' awareness of the potential risks of collaborating with certain Chinese partners. COMMENTARY The Irony of Misinformation: USIA Myths Block Enduring Solutions Unlike Russia and China, the U.S. government has failed to institutionalize the importance of information in foreign policy. The United States lacks formalized leadership structures to tackle information issues head on, and a central organization to coordinate activities to understand, inform, and influence foreign audiences. 8/12 https://www.rand.org/topics/information-operations.html?rows=48&start=48#topicLandingPageList-1165855063-form 10/13/25, 2:53 PM Information Operations | RAND COMMENTARY War of the Worlds: How Cognitive Dissonance and Repression Shape Russian Perceptions of the Conflict in Ukraine Cognitive dissonance theory offers a compelling explanation for one of the confounding phenomena emerging from the war in Ukraine—Russians who refuse to believe their Ukrainian family members' lived experiences of the war. How is it that of the two cognitions Russians are wrestling with, the Kremlin's manufactured truth often prevails? RESEARCH Russian Disinformation Efforts on Social Media Although portrayals of Russia's disinformation machine as organized and well-resourced are exaggerated, social media disinformation can cause serious harm to U.S. interests. This report provides recommendations to better counter this threat. ARTICLE Combating Disinformation by Bolstering Truth and Trust For Jessica Cecil, founder and former head of the Trusted News Initiative, today feels a bit like the Dark Ages after the fall of the Roman Empire, in which agreed-upon facts endure in only a few isolated places of elite discussion and there is no common language of politics. She spoke about the need for governments, companies, news organizations, and relevant civil society groups to work together to combat disinformation at a meeting of RAND Europe's Council of Advisors. ARTICLE Russia Will Struggle to Sustain Its Disinformation Machine, Former New York Times/BBC Chief Tells RAND Europe As former head of the New York Times and the BBC, Mark Thompson has tackled disinformation on both sides of the Atlantic. One of his big takeaways: It's not as easy as you might think to sustain a successful disinformation campaign. 9/12 https://www.rand.org/topics/information-operations.html?rows=48&start=48#topicLandingPageList-1165855063-form 10/13/25, 2:53 PM Information Operations | RAND RESEARCH Do National Security Communication Campaigns Work? Taking a Lesson from the Public Health Sector Through a systematic review of research on public health communication campaigns, the authors identified insights relevant to national security communication campaigns, such as those conducted by the U.S. Army's psychological operations forces. COMMENTARY Effective Use of Nonlethal Weapons Could Require Combating Disinformation The temporary and reversible effects of nonlethal weapons reduce the potential for collateral damage while mitigating the risk of inadvertent escalation in peacetime and gray-zone situations. But public perceptions can have powerful effects on how these systems are employed and the impact of their use. COMMENTARY Preparing for a Cyberattack Starts at the Local Level The ongoing Russian war in Ukraine has highlighted the need for federal, state, and local level emergency managers to prepare to respond to a cyberattack with widespread impacts that significantly disrupt critical infrastructure. COMMENTARY Don't Sleep on Russian Information War Capabilities Ukraine looks to have Russia beat in countering Russian disinformation. But this is only part of the story. Instead of fixating on Russia's missteps, policymakers and analysts would benefit from studying Ukraine's sophisticated information campaign while bearing in mind that Russia retains significant information warfare capabilities and a willingness to use them. RESEARCH Competition in the Gray Zone: Countering China's Coercion Against U.S. Allies and Partners in the Indo-Pacific This report examines how and why China uses gray zone tactics—coercive activities beyond normal diplomacy and trade but below the use of kinetic military force—against U.S. allies and partners in the Indo-Pacific. https://www.rand.org/topics/information-operations.html?rows=48&start=48#topicLandingPageList-1165855063-form 10/12 10/13/25, 2:53 PM Information Operations | RAND RESEARCH SUMMARY A New Framework for Understanding and Countering China's Gray Zone Tactics This brief presents a framework for understanding how and why China uses gray zone tactics—coercive activities beyond normal diplomacy and trade but below the use of kinetic military force—against U.S. allies and partners in the Indo Pacific. COMMENTARY Why the BBC World Service's New Ukrainian Shortwave Service Matters Despite its age, shortwave remains an enduring tool in the global fight against disinformation. It can travel vast distances, cannot be hacked, and is notoriously difficult to jam. Perhaps it's time for the United States to consider whether it should follow the BBC's lead in restarting shortwave services to Ukraine and southeastern Russia. COMMENTARY Keeping Russians Informed About Ukraine Could Help End This War Russia has taken increasingly aggressive actions to restrict access of information about the war in Ukraine. Ensuring that the Russian people know the truth about what their government is doing in Ukraine could bring this war to an end soon rather than later. RESEARCH Decoding Crimea: Pinpointing the Influence Strategies of Modern Information Warfare For this paper we write about information in warfare from the perspective of Strategic Communications (StratCom) and the pursuits of the NATO Strategic Communications Centre of Excellence. RESEARCH Deterrence and Escalation in Competition with Russia: The Role of Ground Forces in Preventing Hostile Measures Below Armed Conflict in Europe In this report, the authors seek to understand how the United States might use its military posture in Europe -- particularly focusing on ground forces -- as part of a strategy to deter Russian malign activities in the competition space. 11/12 https://www.rand.org/topics/information-operations.html?rows=48&start=48#topicLandingPageList-1165855063-form 10/13/25, 2:53 PM Information Operations | RAND RESEARCH Deterrence and Escalation in Competition with Russia: Executive Summary In this report, the authors seek to understand how the United States might use its military posture in Europe -- particularly focusing on ground forces -- as part of a strategy to deter Russian malign activities in the competition space. RESEARCH Conspiracy Theories Have Much in Common. Their Differences May Hold the Key to Identifying When They Turn Violent. RAND/Google collaboration to improve machine learning models to detect and understand the rhetorical functions of conspiracy theories over social media. RESEARCH A Guide to Extreme Competition with China The U.S.-China competitive dynamic is at a critical crossroads. Policymakers can benefit from a new framework for thinking about this challenge and realistic and actionable recommendations that are sensitive to the limits of U.S. competitiveness. RESEARCH 对华终极竞争指南 中美两国的竞争动态正处于一个关键的十字路口。政策制定者可参 考本报告中提出的新理论框架来思考中美竞争问题。同时，我们在 顾及美国影响力的限度之后，提出了务实、可操作的政策方案。 COMMENTARY China, Russia, and Elsewhere During the pandemic, misinformation and conspiracy theories have spread more virulently than ever before. The vast scale of the problem means scalable solutions like machine learning could be needed to rein in the bots, trolls, and conspiracy theories being spread by bad-faith actors. RESEARCH Developing, Disseminating, and Assessing Command Narrative: Anchoring Command Efforts on a Coherent Story Drawing on the scientific literature and lessons learned from the joint force, the authors of this report describe best practices for the effective use of command narrative. TOOL Command Narrative Smart Guide This quick reference provides the big-picture basics for successful command narrative development and deployment. 2/12 https://www.rand.org/topics/information-operations.html?rows=48&start=96#topicLandingPageList-1165855063-form 10/13/25, 2:54 PM Information Operations | RAND RESEARCH Bad Actors in News Reporting: Tracking News Manipulation by State Actors Researchers found that both Russia and China appear to have manipulated information during the pandemic in service to their respective global agendas. This second report in a series describes these efforts and the workflows used to uncover them. RESEARCH Analysis of Russian Irregular Threats The authors of this report describe strategic global trends related to Russian global influence and behavior and provide an overview and assessment of hostile activities that Russia has undertaken in the face of these trends. RESEARCH Evaluating the Effectiveness of Public Communication Campaigns and Their Implications for Strategic Competition with Russia The authors examine evidence on the effectiveness of campaigns to influence public opinion in target populations -- sometimes referred to as \"information warfare\" -- in the context of strategic competition between the United States and Russia. RESEARCH Countering Russia: The Role of Special Operations Forces in Strategic Competition This report establishes a strategic framework for U.S. Army special operations forces support to countering Russian activities in the competition space. This volume is an important resource for anyone who is interested in gaining an informed understanding of China, a major strategic competitor of the United States in the economic, technological, diplomatic, and security realms. 3/12 https://www.rand.org/topics/information-operations.html?rows=48&start=96#topicLandingPageList-1165855063-form 10/13/25, 2:54 PM Information Operations | RAND Select RAND Research on Counterinsurgency, Stability Operations, Support to Foreign Internal Defense, Nation This volume is an important resource for those interested in gaining an informed understanding of a persistent, though usually low-level, military threat to U.S. security. Select RAND Research on Security This volume is a resource for those interested in gaining an informed understanding of security cooperation, a term that refers to the variety of activities that the United States undertakes to strengthen its military partners and partnerships. Select RAND Research on the Information This volume is an important resource for anyone who is interested in gaining an informed understanding of operations in the information environment. Taking Stock of RAND's Research About the Information Environment Information, or how to obtain knowledge from investigation, study, or instruction, has always been a critical and broad element of the human experience. However, the advent of the internet and the increasing connectivity of humanity has exponentially increased the pool of information and data available to us. This environment provides opportunities for and presents challenges to the United States; harnessing the power of information and using it to increase efficiencies, improve security, and deny access and advantages to adversaries are all topics that RAND Corporation research has examined in this sphere. TOOL Handbook for Tactical Operations in the Information Environment With its quick-reference format and series of illustrative vignettes, this handbook facilitates problem-solving and highlights how early-career officers in tactical units can contribute to operations in the information environment. 4/12 https://www.rand.org/topics/information-operations.html?rows=48&start=96#topicLandingPageList-1165855063-form 10/13/25, 2:54 PM Information Operations | RAND RESEARCH Leveraging Complexity in Great-Power Competition and Warfare: Volume I, An Initial Exploration of How Complex Adaptive Systems Thinking Can Frame Opportunities and Challenges This report is the first in a two-part series that examines how complex adaptive systems thinking can be applied to great power competition and warfare to aid in understanding how complexity might be exploited to U.S. advantage. RESEARCH Leveraging Complexity in Great-Power Competition and Warfare: Volume II, Technical Details for a Complex Adaptive Systems Lens This is a technical report that supports a companion report, Leveraging Complexity in Great-Power Competition and Warfare: Volume I, An Initial Exploration of How Complex Adaptive Systems Thinking Can Frame Opportunities and Challenges. TOOL The Information Warfighter Exercise Wargame: Rulebook This document presents the full ruleset for the Information Warfighter Exercise Wargame, which is used by the Marine Corps to provide training for aspects of operations in the information environment. RESEARCH Understanding and Defending Against Russia's Malign and Subversive Information Efforts in Europe The authors describe apparent efforts by Russia and its agents to use information to shape Russia's operating environment, and they identify possible defensive approaches for United States European Command and its partners. 5/12 https://www.rand.org/topics/information-operations.html?rows=48&start=96#topicLandingPageList-1165855063-form 10/13/25, 2:54 PM Information Operations | RAND Combating Foreign Disinformation on Social Media How are countries using social media--particularly disinformation campaigns--to influence the competitive space? How have governments, the private sector, and civil society responded to this threat? What more can be done? And what do all these conditions mean for future U.S. Air Force and joint force training and operations? RESEARCH Combating Foreign Disinformation on Social Media: Study Overview and Conclusions Disinformation campaigns on social media pose a nuanced threat to the United States, but the response remains ad hoc and uncoordinated. This overview of a five-volume series presents ways to better prepare for this new age of information warfare. RESEARCH Chinese Disinformation Efforts on Social Media The authors identify key Chinese practices and the supporting infrastructure and conditions that successful social media disinformation campaigns require, concluding that China is using Taiwan as a test bed for developing attack vectors. RESEARCH Understanding and Pursuing Information Advantage This article tries to unpack the concept of \"information advantage\" and explore what it might mean and how it should be thought about by the U.S. Army and the joint force more broadly. RESEARCH A Compendium of Recommendations for Countering Russian and Other State Sponsored Propaganda To help audiences make sense of the large array of counterdisinformation recommendations, the authors of this report coded recommendations in 64 other policy reports and assessed which recommendations benefit from researcher consensus. 6/12 https://www.rand.org/topics/information-operations.html?rows=48&start=96#topicLandingPageList-1165855063-form 10/13/25, 2:54 PM Information Operations | RAND RESEARCH Deciphering Chinese Deterrence Signalling in the New Era: An Analytic Framework and Seven Case Studies The authors examine how China's approach to deterrence signalling is evolving along with its expanding objectives, growing military capabilities, and the availability of new communication channels—and how regional countries should respond. RESEARCH Exploring Chinese Military Thinking on Social Media Manipulation Against Taiwan This article addresses a gap in the current policy discussion, provides evidence of Chinese military planning for covert manipulation of Taiwanese social media, and explores how its interest in and tactics for social media manipulation have evolved over time. RESEARCH Cognitive Domain Operations: The PLA's New Holistic Concept for Influence Operations As information becomes ever more central for Chinese warfighting, the People's Liberation Army is developing a new concept for psychological warfare in the information era called \"cognitive domain operations.\" RESEARCH Borrowing a Boat Out to Sea: The Chinese Military's Use of Social Media for Influence Operations The Chinese military is positioning itself as one of the leading actors for hostile Chinese influence operations on social media. The PLA uses social media for covert hostile political interference operations targeting foreign countries. RESEARCH RAND's Scalable Warning and Resilience Model (SWARM): Enhancing Defenders' Predictive Power in Cyberspace The model introduced in this report is intended to enhance the predictive capabilities available to cyber defenders while also augmenting resilience by improving preventions and detections of cyber threats. 7/12 https://www.rand.org/topics/information-operations.html?rows=48&start=96#topicLandingPageList-1165855063-form 10/13/25, 2:54 PM Information Operations | RAND RESEARCH Superspreaders of Malign and Subversive Chinese Efforts Targeting the United States This report, part of the Truth Decay initiative, is one in a series describing malign and subversive information efforts Russian and Chinese outlets appear to have used to target U.S. audiences. RESEARCH Detecting Conspiracy Theories on Social Media: Improving Machine Learning to Detect and Understand Online Conspiracy Theories Using linguistic and rhetorical theory, researchers developed an improved model of machine-learning technology to detect conspiracy theory language. This report describes the results and suggests ways to counter effects of online conspiracy theories. COMMENTARY Towards an AI-Based Counter Disinformation Framework Artificial intelligence is being used to develop sophisticated malign information on social media. But AI also provides opportunities to strengthen responses to these threats and can foster wider resilience to disinformation. RESEARCH Countering Foreign Interference in U.S. Elections This report describes responses to both Russian memes designed to breed dissension and a public service announcement warning about threats from foreign interference in U.S. elections. This is the fourth report in a series on election security. RESEARCH Tweeting Out Surveys to Pro-Ukraine Influencers: Exploring the Potential for Enlisting Support in the Information Fight Against Russia RAND researchers used Twitter advertisements to solicit survey participation from the most-influential members of the pro-Ukraine activist community, drawing on key influencers to help counter Russian propaganda in the region. 8/12 https://www.rand.org/topics/information-operations.html?rows=48&start=96#topicLandingPageList-1165855063-form 10/13/25, 2:54 PM Information Operations | RAND RESEARCH The Evolution of Special Operations as a Model for Information Forces This article draws an analogy between special operations and information forces and suggests the history and evolution of SOF could serve as a model and provide lessons for the development of information forces. ARTICLE Here are the RAND research projects that resonated most in remote learning, election disinformation, income inequality, and more. RESEARCH Intelligence Support for Operations in the Information Environment: Dividing Roles and Responsibilities Between Intelligence and Information Professionals Operations in the information environment require close coordination between intelligence and information operations personnel, but this does not often occur in practice. A review of these challenges highlighted a range of potential solutions. RESEARCH SUMMARY Improving Intelligence Support for Operations in the Information Environment Challenges to effective intelligence support for operations in the information environment (OIE) can be addressed by improving processes, prioritizing support for OIE, training and educating personnel, and optimally allocating personnel. RESEARCH SUMMARY تﺎﻣوﻠﻌﻣﻟا ﺔﺋﯾﺑ ﻲﻓ تﺎﯾﻠﻣﻌﻠﻟ ﻲﺗارﺎﺑﺧﺗﺳﻻا مﻋدﻟا نﯾﺳﺣﺗ ﺔﺌﯿﺑ ﻲﻓ تﺎﯿﻠﻤﻌﻠﻟ ﺔﯿﺗارﺎﺒﺨﺘﺳﻻا تﺎﺟﺎﯿﺘﺣﻻا ﺔﯿﺒﻠﺗ ﮫﺟاﻮﺗ ﻲﺘﻟا تﺎﯾﺪﺤﺘﻟا ﺔﮭﺟاﻮﻣ ﻦﻜﻤﯾ ﺎﻣو تﺎﻣﻮﻠﻌﻤﻟا ﺔﺌﯿﺑ ﻲﻓ تﺎﯿﻠﻤﻌﻟا ﻢﻋﺪﻟ ﺔﯾﻮﻟوﻷا ءﺎﻄﻋإو ،تﺎﯿﻠﻤﻌﻟا ﻦﯿﺴﺤﺗ لﻼﺧ ﻦﻣ تﺎﻣﻮﻠﻌﻤﻟا ﺔﺌﯿﺑ تﺎﯿﻠﻤﻋ ﻲﻓ ﻦﯿﻠﻣﺎﻌﻟا ردﺎﻜﻟ ﻢﯿﻠﻌﺘﻟاو ﺐﯾرﺪﺘﻟا صﺮﻓ ةدﺎﯾزو ،تارﺪﻘﻠﻟ جﺎﻣدإ ﻦﻣ ﺎﮭﺑ ﻂﺒﺗﺮﯾ .ﺐﺳﺎﻨﻣ ﻞﻜﺸﺑ ﻦﯿﻔظﻮﻤﻟا ﻊﯾزﻮﺗو ،تﺎﻣﻮﻠﻌﻤﻟا 9/12 https://www.rand.org/topics/information-operations.html?rows=48&start=96#topicLandingPageList-1165855063-form 10/13/25, 2:54 PM Information Operations | RAND RESEARCH Human Aspects of Air Force Operations: The Roles of Social, Cultural, and Political Knowledge and Skills in the Full Spectrum of Multidomain Operations The authors examine whether there is a need for a joint warfighting domain focused on human aspects of military operations and consider how sociocultural knowledge and skills could be better integrated into conventional Air Force operations. RESEARCH Social Media and Influence Operations Technologies: Implications for Great Power Competition Russia, China, and the so-called Islamic State are three key U.S. adversaries that have exploited online technologies for propaganda. This chapter reviews the aims, capabilities, and limitations of online propaganda for each of these entities. PODCAST Expert Insights: Using AI to Tackle Disinformation Online RAND Europe analyst Linda Slapakova talks with RAND senior behavioral scientist William Marcellino about their study on human-machine detection of online-based malign information. They discuss how their report used a combination of human analysis and machine learning to identify disinformation on social media in the context of the and machine learning model can be used to help address similar challenges in the future. PRESS Facebook Users May Spread Russian Propaganda Less Often When They Are Aware of Its Source Russian propaganda is hitting its mark on social media— generating strong partisan reactions that may help intensify political divisions—but Facebook users are less apt to press the “like” button on content when they learn that it is part of a foreign propaganda campaign. https://www.rand.org/topics/information-operations.html?rows=48&start=96#topicLandingPageList-1165855063-form 10/12 10/13/25, 2:54 PM Information Operations | RAND RESEARCH Russian Propaganda Hits Its Mark: Experimentally Testing the Impact of Russian Propaganda and Counter-Interventions This report, the third in a series, describes a study designed to assess how people react to and engage with Russia's online propaganda. Media literacy advisories and labeling the source of the propaganda were found to have a counter effect. PRESS Coordinated Efforts on Twitter to Interfere in the U.S. Presidential Election Are Likely Foreign A coordinated effort on Twitter to influence the upcoming U.S. presidential election—using trolls (fake personas that spread hyper-partisan themes) and super-connectors (highly networked accounts)—aims to sow distrust, exacerbate political divisions and undermine confidence in American democracy. RESEARCH Tools for Detecting Online Election Interference This report, the second in a series on information efforts by foreign actors, describes what appears to be an instance of election interference on Twitter and offers recommendations for response. RESEARCH Counter-Radicalization Bot Research: Using Social Bots to Fight Violent Extremism As the online recruitment of violent extremist organizations grows, the U.S. government may benefit from promising emerging technology tools to rapidly detect targets of such recruitment efforts and deliver counter-radicalization content to them. RESEARCH From Consensus to Conflict: Understanding Foreign Measures Targeting U.S. Elections Russia might try to manipulate and divide U.S. voters via social media during the U.S. political campaign season of foreign actors targeting local, state, and national elections. PRESS Foreign Interference in U.S. Elections Focuses on Cultivating Distrust to Reduce Political Consensus Foreign interference in U.S. elections likely focuses, in part, on creating distrust among Americans, with paralyzing the American political process as its main goal. VIDEO 2:43 Election RAND military sociologist Marek Posard describes several broad risks of foreign interference in American democracy and explains how Russia may use reflexive control theory to COMMENTARY Insider Threat at Twitter Is a Risk to Everyone Three young hackers were charged in the hijacking of dozens of high-profile Twitter accounts. Their tactics point out how vulnerabilities at tech platforms can pose a risk to national security. COMMENTARY How You Can Fight Russia's Plans to Troll The goal of Russian interference is to trigger emotional reactions and drive people to ideological extremes, making it nearly impossible to build a consensus. But Americans are less likely to have their emotions manipulated if they are aware that manipulation is the goal. 2/11 https://www.rand.org/topics/information-operations.html?rows=48&start=144#topicLandingPageList-1165855063-form 10/13/25, 2:56 PM Information Operations | RAND RESEARCH Frameworks for Assessing USEUCOM Efforts to Inform, Influence, and Persuade It can be challenging to assess the progress, performance, and effectiveness of efforts to inform, influence, and persuade in support of U.S. national security objectives. This report presents robust and flexible frameworks to enhance assessment. RESEARCH Opportunities for Including the Information Environment in U.S. Marine Corps Wargames An examination of requirements, principles from military theory, current doctrine, and wargaming practices points to solutions and changes to game mechanics to better incorporate the information environment into wargames. COMMENTARY A Machine Learning Approach Could Help Counter Disinformation Disinformation has become a central feature of the COVID “deepfake” imagery poses a risk to democratic societies worldwide by increasing public mistrust in governments and public authorities. New research highlights new ways to detect and dispel disinformation online. PROJECT Using machine learning to detect malign information efforts online Researchers successfully developed and applied a machine learning model to a known Russian troll database to identify differences between authentic political supporters and Russian ‘trolls’ involved in online debates relating to the RESEARCH Human-machine detection of online-based malign information RAND Europe developed a method to detect the malign use of information online for the UK Ministry of Defence's Defence and Security Accelerator. 3/11 https://www.rand.org/topics/information-operations.html?rows=48&start=144#topicLandingPageList-1165855063-form 10/13/25, 2:56 PM Information Operations | RAND COMMENTARY Exposing Russian Information Operations Does Not Violate the First Amendment Russia's hostile information operations are continuous and extend to a broad range of domestic issues. First Amendment concerns are important, but they do not protect hostile information campaigns by foreign actors, nor are they a legal excuse for inaction by the United States. RESEARCH Detecting Malign or Subversive Information Efforts over Social Media: Scalable Analytics for Early Warning The authors examine scalable analytic means to detect malign or subversive information efforts. The report has operational relevance to the U.S. government and may also benefit other researchers and social media companies dealing with malign actors. EXPERT INSIGHTS Understanding Russian Subversion: Patterns, Threats, and Responses This Perspective examines the interests that inspire Russia's use of subversion, the means involved, recent events that illustrate attempts at Russian subversion, and ways to improve the response to subversion attempts. COMMENTARY Artificial Intelligence and the Manufacturing of Reality Humans carry flaws in deciding what is or is not real. The internet and other technologies have made it easier to weaponize and exploit these flaws. And artificial intelligence will likely be used to exploit these weaknesses at an unprecedented scale, speed, and level of effectiveness. COMMENTARY What Translation Troubles Can Tell Us About Russian Information Warfare Moscow's form of information warfare targeting the West especially through its reinvigorated military intelligence branch. Nonetheless, little research has focused on these campaigns' apparent shortcomings. Most notable among operational errors are the confusing translation mistakes that undermine attempts at covert influence efforts. 4/11 https://www.rand.org/topics/information-operations.html?rows=48&start=144#topicLandingPageList-1165855063-form 10/13/25, 2:56 PM Information Operations | RAND PRESS Hostile Social Manipulation by Russia and China a Growing but Poorly Understood Threat With the role of information warfare in global strategic competition becoming much more apparent, a new RAND Corporation report delves into better defining and understanding the challenge facing the United States by focusing on the hostile social manipulation activities of the two leading users of such techniques: Russia and China. RESEARCH Hostile Social Manipulation: Present Realities and Emerging Trends The practitioners of hostile social manipulation employ social media, forgeries, harassment, distribution of rumors, and other tools to cause damage to their target state. This report focuses on the information warfare activities of Russia and China. RESEARCH Using an Inoculation Message Approach to Promote Public Confidence in Protective Agencies This investigation tested the effectiveness of inoculation as a pre-crisis strategy in combating the effects of politically motivated violent acts. RESEARCH Assessing Against and Moving Past the \"Funnel\" Model of Counterterrorism Communication Through numerous forms of media, terrorists are embracing new opportunities to spread the psychological impact of terrorism throughout the world. This article discusses the promise and challenges of counterterrorism communication efforts. RESEARCH Gaining Competitive Advantage in the Gray Zone: Response Options for Coercive Aggression Below the Threshold of Major War In this report, the authors examine how the United States might respond to Russian and Chinese efforts to seek strategic advantage through coercive actions in the gray zone. 5/11 https://www.rand.org/topics/information-operations.html?rows=48&start=144#topicLandingPageList-1165855063-form 10/13/25, 2:56 PM Information Operations | RAND COMMENTARY Fighting and Winning the Undeclared Cyber War Russia has executed deliberate intrusions into U.S. critical included government entities, commercial facilities, water resource plants, and aviation institutions. What actions or policies can the U.S. execute to improve security? RESEARCH SUMMARY The Growing Need to Focus on Modern Political Warfare RAND researchers analyzed how political warfare is practiced today and identified ways that the U.S. government, its allies, and its partners can respond to or engage in this type of conflict to achieve U.S. ends and protect U.S. interests. COMMENTARY Mueller Report May Result in Russian Sanctions but Not Better Behavior The Mueller report could help mobilize political pressure in the United States for a stronger posture toward Russian activities that harm American and allied interests. But the Kremlin will likely still see propaganda, disinformation, and subterfuge as useful tools to undermine America's values and cohesion. PODCAST 2 items Approaches to Counter Russian Social Media Influence In this congressional briefing, RAND information scientist Elizabeth Bodine-Baron discusses the challenges in combating the threat of Russian influence via disinformation spread on social media. COMMENTARY Is It Time to Abandon the Term Information Operations? Operations in the information environment will be a critical part of future joint force operations and should be baked in to those operations as a fully valued tool in commanders' combined arms toolboxes. Reaching that goal will require greater acceptance and understanding of information across the joint force, new structures for information forces, and the evolution of how operations in the information environment are handled within the staff. 6/11 https://www.rand.org/topics/information-operations.html?rows=48&start=144#topicLandingPageList-1165855063-form 10/13/25, 2:56 PM Information Operations | RAND COMMENTARY Russia's Soft Strategy to Hostile Measures in Europe They've been called political warfare, measures short of war, gray zone warfare, and a host of other terms. Russia has used a wide range of hostile measures to expand its influence and undermine governments across the European continent. These tactics should be appreciated for what they are: part of a larger, coherent Russian effort, but ultimately not an insurmountable one. RESEARCH Russia's Hostile Measures in Europe: Understanding the Threat This report examines current Russian hostile measures in Europe and forecasts how Russia might threaten Europe using these measures over the next few years. Waging War Beyond the Battlefield: Remarks at the Celebration of 50 Years at RAND At an event commemorating his 50 years of service at RAND, Brian Michael Jenkins spoke about terrorism and the United States' response to it over the past several decades. ARTICLE RAND serves as an objective source of facts that help inform the world's most pressing policy debates. When decisions are based on the best evidence, that's when public policy can have a positive impact on people's lives. We're highlighting the 10 research projects that RAND.org readers found most engaging this year. ARTICLE And, By the Way, They Were All Women: RAND Hosts Forum on 21st-Century Warfare Honoring Roberta Wohlstetter National security experts, flag officers, and decisionmakers attended the Roberta Wohlstetter Forum on National Security at RAND's Washington office on October 24. The featured speakers, moderators, organizers, donor, and namesake for the event were all women. 7/11 https://www.rand.org/topics/information-operations.html?rows=48&start=144#topicLandingPageList-1165855063-form 10/13/25, 2:56 PM Information Operations | RAND RESEARCH Improving C2 and Situational Awareness for Operations in and Through the Information Environment Every military activity has informational aspects, but the information environment (IE) is not well integrated into military planning, doctrine, or processes. Better understanding of the IE will improve command and control and situational awareness. RESEARCH SUMMARY Requirements for Better C2 and Situational Awareness of the Information Environment Every military activity has informational aspects, but the information environment (IE) is not well integrated into military planning, doctrine, or processes. Better understanding of the IE will improve command and control and situational awareness. RESEARCH Countering Russian Social Media Influence The Russian government's campaigns of disinformation -- political, social, religious, or otherwise -- have found a comfortable home on social media. This report presents strategies to counter Russian social media influence. VIDEO 3:04 Highlights from the Roberta Wohlstetter Forum on National Security A forum on national security honors the legacy of Roberta Wohlstetter, a military analyst who worked at RAND from its capabilities, technologies, and methodologies that demand new concepts for national security and defense. RESEARCH The Language of Inform, Influence, and Persuade: Assessment Lexicon and Usage Guide for U.S. European Command Efforts Inconsistency in how assessment is discussed can lead to confusion, miscommunication, and the appearance of agreement or disagreement when the opposite is true. RAND researchers developed this lexicon and usage guide to help combat this problem. 8/11 https://www.rand.org/topics/information-operations.html?rows=48&start=144#topicLandingPageList-1165855063-form 10/13/25, 2:56 PM Information Operations | RAND EXPERT INSIGHTS Russian Social Media Influence: Understanding Russian Propaganda in Eastern Europe: Addendum testimony before the Senate Select Committee on EXPERT INSIGHTS Russia's Use of Media and Information Operations in Turkey: Implications for the United States This Perspective assesses how Russia has used media and information operations to support its foreign policy goals related to Turkey. COMMENTARY Iran's Disinformation Campaigns New reports suggest that the Kremlin may have company in its efforts to shape the United States' domestic information landscape: Iran. As Americans prepare to return to the voting booths this fall, Washington would be well advised to look into Iran's disinformation capabilities and intentions. COMMENTARY Here's How Russia Will Try to Interfere in the Russia will threaten U.S. midterm elections in November, although by how much is unclear. Moscow might be more restrained this year, but it could be wilier. EXPERT INSIGHTS Russian Social Media Influence: Understanding Russian Propaganda in Eastern Europe Testimony presented before the Senate Select Committee on RESEARCH Lessons from Others for Future U.S. Army Operations in and Through the Information Environment An examination of the evolution of both allied and adversary use of information power, alongside a comparative analysis of capability areas in which these others excel, can guide future U.S. Army force planning. 9/11 https://www.rand.org/topics/information-operations.html?rows=48&start=144#topicLandingPageList-1165855063-form 10/13/25, 2:56 PM Information Operations | RAND RESEARCH Lessons from Others for Future U.S. Army Operations in and Through the Information Environment: Case Studies Twelve detailed case studies examine of the activities and strategic goals of allies, adversaries, and potential adversaries in and through the information environment, highlighting insights for U.S. Army planning. RESEARCH Paradigm Change: Operational Art and the Information Joint Function The potential benefit of information as a joint function is clear. Commanders could measure campaign success by evaluating emergent behavior of relevant actors defining strategic outcomes rather than focusing too intently on the physics of fighting. COMMENTARY Defeating the ISIS Nostalgia Narrative It is crucial that the United States and its coalition partners take into consideration and preempt the ISIS nostalgia narratives that may seek to define the group's legacy and prepare a foundation for its resurgence throughout the Middle East and beyond. The legacy ISIS should be remembered for is one of misery and despair. COMMENTARY Political Warfare Is Back with a Vengeance The United States' principal adversaries are fighting and gaining ground by employing a host of tactics short of all out war. This form of warfare, once called political warfare, is back with a vengeance, empowered by new tools and techniques. PRESS RAND Identifies New Strategies for Countering Russian Social Media Influence in Eastern Europe Russia is waging a social media campaign in the Baltics, Ukraine and nearby states to sow dissent against neighboring governments, as well as NATO and the European Union. 10/11 https://www.rand.org/topics/information-operations.html?rows=48&start=144#topicLandingPageList-1165855063-form 10/13/25, 2:56 PM Information Operations | RAND RESEARCH Russian Social Media Influence: Understanding Russian Propaganda in Eastern Europe Researchers analyzed Russian social media data and conducted interviews with regional and security experts to understand the critical ingredients to countering Russia's propaganda campaign against former Soviet states. PRESS RAND Study Examines Ways U.S. Can Better Counter Political Warfare The United States needs to improve the ways it combats adversaries adept at using political warfare tactics to achieve their goals and undermine U.S. interests and allies. RESEARCH Modern Political Warfare: Current Practices and Possible Responses Analyzes how political warfare is practiced today and identifies the most effective ways that the U.S. government, along with its allies and partners, can respond to or engage in this type of conflict to achieve U.S. ends and protect U.S. interests. COMMENTARY Putin's Boasting About Nuclear Weapons Won't Help Him in the Russian Election In a March 1 address to the nation, Russian President Vladimir Putin evoked Soviet-era exaggeration, proclaiming barely feasible economic and social goals and boasting of nuclear arms that are unlikely to change the strategic balance. Continued exaggeration could sap public confidence in the legitimacy of Russia's ruling system and leaders. COMMENTARY Getting Ready to Fight the Next (Cyber) War Nation-states and their proxies are regularly spying and attacking in cyberspace across national borders. The U.S. and other Western societies that are being targeted should do three things: Be less vulnerable, be able to recognize and mitigate the impact of attacks faster, and be prepared to respond in kind to all levels of offense. COMMENTARY Beijing's Influence Operations Target Chinese Diaspora China's efforts to cultivate support in and control diaspora communities threaten to worsen inter-ethnic tensions, aggravate political and social polarization, and harm the civil rights and freedoms of citizens in other countries. Such activities merit close attention by democratic governments seeking to counter China's influence operations. 2/11 10/13/25, 2:58 PM Information Operations | RAND COMMENTARY Free Lunches for Adversaries When leaders take actions that are unpopular with wide audiences, propagandists have it easy. While Western leaders should not make propaganda potential the primary factor when weighing policy decisions, neither should they wholly disregard the opportunities that unpopular policies will offer adversaries. RESEARCH Systems Confrontation and System Destruction Warfare: How the Chinese People's Liberation Army Seeks to Wage Modern Warfare This report reflects an attempt to understand current thinking in the Chinese People's Liberation Army regarding system of systems and systems warfare, as well as current methods of warfighting. COMMENTARY Invisible Doomsday Machines: The Challenge of Clandestine Capabilities and Deterrence As the United States increasingly contemplates acquiring clandestine capabilities for deterrence and warfighting, it should consider rethinking its approach to managing these programs. A unified management approach would go a great distance toward meeting the challenges of these capabilities. RESEARCH The Creation of the PLA Strategic Support Force and Its Implications for Chinese Military Space Operations This report explores the missions and organization of and employ space capabilities, in particular launch and operation of satellites to provide C4ISR capabilities for joint operations. RESEARCH ﻲﻧﯾﺻﻟا ﻲﺑﻌﺷﻟا رﯾرﺣﺗﻟا شﯾﺟﺑ ﻲﺟﯾﺗارﺗﺳﻻا مﻋدﻟا تاوﻗ ءﺎﺷﻧإ ﺔﯾﻧﯾﺻﻟا ﺔﯾرﻛﺳﻌﻟا ﺔﯾﺋﺎﺿﻔﻟا تﺎﯾﻠﻣﻌﻟا ﻰﻠﻋ ﺎﮭﺗﺎﯾﻋادﺗو ﻞﻜﯿﮭﻟا ﻰﻠﻋ ﺰﯿﻛﺮﺘﻟﺎﺑ ،ﺎﮭﻣﺎﮭﻣو ،ﺔﯿﻨﯿﺼﻟا ﺔﯾﺮﻜﺴﻌﻟا ءﺎﻀﻔﻟا ﺔﺴﺳﺆﻣ ﻢﯿﻈﻨﺘﻟ ﺔﺳارﺪﻟا هﺬھ قﺮﻄﺘﺗ تاﻮﻗ ءﺎﺸﻧإ ﻢﺗ .ﻲﻨﯿﺼﻟا ﻲﺒﻌﺸﻟا ﺮﯾﺮﺤﺘﻟا ﺶﯿﺠﻟ ﺔﻌﺑﺎﺘﻟا ﻲﺠﯿﺗاﺮﺘﺳﻻا ﻢﻋﺪﻟا تاﻮﻘﻟ ﻲﻤﯿﻈﻨﺘﻟا .ﺔﻛﺮﺘﺸﻤﻟا تﺎﯿﻠﻤﻌﻠﻟ C4ISR تارﺪﻗ ﺮﯿﻓﻮﺘﻟ ﺔﯿﻋﺎﻨﺼﻟا رﺎﻤﻗﻷا ﻞﯿﻐﺸﺗو 3/11 10/13/25, 2:58 PM Information Operations | RAND COMMENTARY How Hezbollah Came to Dominate Information Warfare Hezbollah's information warfare portfolio includes newspapers, social media outlets, television programming, and a major internet presence. Its websites reflect the group's diverse agenda and aim to be multi-generational in their approach, offering information about social services as well as a video game to engage youth. COMMENTARY The Islamic State May Be Failing, but Its Strategic Communications Legacy Is Here to Stay The Islamic State's caliphate is collapsing but its legacy will live on virtually because of its information operations. The scale of the menace presented by the group today pales in comparison to other global challenges, yet it manages to dominate and terrorize the public mind. COMMENTARY Russian Information Warfare: A Reality That Needs a Response For the last three decades, Russia has exploited its growing capabilities in cyberspace to spy on, influence, and punish others. The West will continue to struggle to hold Moscow accountable, in part because international law falls far short of fully defining the rules or resolving conflicts. RESEARCH Cyber Power Potential of the Army's Reserve Component Describes the availability of personnel with cyber skills in the private sector and the number of Army reserve component soldiers available to support the Army's cyber mission needs. RESEARCH Monitoring Social Media: Lessons for Future Department of Defense Social Media Analysis in Support of Information Operations To support the U.S. Department of Defense in expanding its capacity for social media analysis, this report reviews the analytic approaches that will be most valuable for information operations and considerations for implementation. 4/11 10/13/25, 2:58 PM Information Operations | RAND RESEARCH ﻲﻋﺎﻣﺗﺟﻻا لﺻاوﺗﻟا لﺋﺎﺳو دﺻر ،ﻲﻋﺎﻤﺘﺟﻻا ﻞﺻاﻮﺘﻟا ﻞﺋﺎﺳو ﻞﯿﻠﺤﺗ ﻰﻠﻋ ﺎﮭﺗرﺪﻗ ﻊﯿﺳﻮﺗ ﻲﻓ ﺔﯿﻜﯾﺮﻣﻷا عﺎﻓﺪﻟا ةرازو ﻢﻋﺪﻟ .تﺎﻣﻮﻠﻌﻤﻟا تﺎﯿﻠﻤﻌﻟ ﺔﻤﯿﻗ ﺮﺜﻛﻷا نﻮﻜﺘﺳ ﻲﺘﻟا ﺔﯿﻠﯿﻠﺤﺘﻟا ﺞﮭﻨﻟا ﺔﺳارﺪﻟا هﺬھ ضﺮﻌﺘﺴﺗ COMMENTARY NATO: Prepared for Countering Disinformation Operations in the Baltic States? NATO alliance countries deploying to the Baltics should prepare to deal with increasing levels of disinformation. An open and robust communication strategy could be crucial in tackling a sophisticated Russian disinformation campaign aimed at disrupting support for these deployments. EXPERT INSIGHTS Understanding Russian \"Hybrid Warfare\": And What Can Be Done About It: Addendum testimony before the House Armed Services Committee on RESEARCH ﺎﯾﻧارﻛوأ قرﺷو مرِﻘﻟا ةرﯾزﺟ ﮫﺑﺷ ﻲﻓ ﺎﯾﺳور تﺎﯾﻠﻣﻋ نﻣ ٌ رَﺑِﻋ راذآ /سرﺎﻣ- طﺎﺒﺷ/ﺮﯾاﺮﺒﻓ) ﺎﯿﺳور ﻞﺒﻗ ﻦﻣ مﺮﻘﻟا ةﺮﯾﺰﺟ ﮫﺒﺷ ﻢﺿ ﺔﯿﻠﻤﻋ ﺔﺳارﺪﻟا هﺬھ ﻢّﯿﻘﺗ RESEARCH Lessons from Russia's Operations in Crimea and Eastern Ukraine This report assesses the annexation of Crimea by Russia mobilization and combat operations in Eastern Ukraine (late EXPERT INSIGHTS The Weaponization of Information: The Need for Cognitive Security Testimony presented before the Senate Armed Services Committee, Subcommittee on Cybersecurity on April 27, 5/11 10/13/25, 2:58 PM Information Operations | RAND RESEARCH Dominating Duffer's Domain: Lessons for the U.S. Marine Corps Information Operations Practitioner To support the U.S. Marine Corps and its curriculum for information operations personnel, RAND has adapted the premise of the military classic The Defence of Duffer's Drift for a modern-day audience of Marine Corps officers. RESEARCH Dominating Duffer's Domain: Lessons for the U.S. Army Information Operations Practitioner Adapting the format of military classic, The Defence of Duffer's Drift, this report analyzes alternative courses of action in the same hypothetical mission in order to derive lessons about integrating information operations into operational planning. COMMENTARY Reservists and the National Guard Offer Untapped Resources for Cybersecurity More than 100,000 personnel in the Army National Guard and the U.S. Army Reserve have some degree of cyber competence, including thousands with deep or mid-level expertise. They could help defend the cyber terrain on which America's national security, prosperity, and democracy depend. RESEARCH Tactical Cyber: Building a Strategy for Cyber Support to Corps and Below This report proposes a strategy for tactical Army cyber operations, enumerating overarching goals, objectives, and associated activities. Instructive case studies are provided that support implementation of the strategy. VIDEO 3:08 Understanding Russian \"Hybrid Warfare\" and What Can Be Done About It Testimony presented before the House Armed Services 6/11 10/13/25, 2:58 PM Information Operations | RAND RESEARCH Assessing and Evaluating Department of Defense Efforts to Inform, Influence, and Persuade: Worked Example This report presents a realistic but fictional scenario as context for how assessment planning for inform, influence, and persuade efforts should work in practice, demonstrating core principles and best practices for developing effective assessments. EXPERT INSIGHTS Understanding Russian \"Hybrid Warfare\": And What Can Be Done About It Testimony presented before the House Armed Services RESEARCH Hybrid Warfare in the Baltics: Threats and Potential Responses This report considers the various possible forms of hybrid aggression in the Baltics and concludes that the major vulnerability of the Baltics is to conventional aggression. RESEARCH ﺔﻠ َﻣﺗﺣُﻣﻟا تﺎﺑﺎﺟﺗﺳﻻاو تادﯾدﮭﺗﻟا : ﻖﯾطﻠﺑﻟا ﺔﻘطﻧﻣ ﻲﻓ ﺔﻧﯾﺟﮭﻟا برﺣﻟا نأ ﻰﻟإ ﺺﻠﺨﺗو ،ﻖﯿﻄﻠﺒﻟا لود ﻲﻓ ﻞﻤﺘﺤﻤﻟا ﻦﯿﺠﮭﻟا ناوﺪﻌﻟا لﺎﻜﺷأ ﻒﻠﺘﺨﻣ ﺔﺳارﺪﻟا هﺬھ لوﺎﻨﺘﺗ .يﺪﯿﻠﻘﺘﻟا ناوﺪﻌﻟا ﻮھ ﻖﯿﻄﻠﺒﻟا لود ﻲﻓ ﻲﺴﯿﺋﺮﻟا ﻒﻌﻀﻟا RESEARCH On Strategic Communications Today: Enhancing US Efforts to Inform, Influence, and Persuade Capabilities to inform, influence, and persuade are necessary both for national security success and as a cost effective toolset relative to physical military power. ARTICLE Beyond the Headlines: RAND's Christopher Paul Discusses the Russian 'Firehose of Falsehood' A massive, ingenious, and concerning campaign of propaganda has been pumping westward for years, supporting the Russian agenda in Ukraine and Syria and likely trying to influence the U.S. presidential election. 7/11 10/13/25, 2:58 PM Information Operations | RAND COMMENTARY Russian Propaganda Is Pervasive, and America Is Behind the Power Curve in Countering It Even as Washington pursues cooperation with Moscow on Syria and other issues, America should expose Russia's obsession with propaganda and disinformation. EXPERT INSIGHTS The Russian \"Firehose of Falsehood\" Propaganda Model: Why It Might Work and Options to Counter It remarkable evolution in Russia's approach to propaganda. Effective solutions can be found in the same psychology literature that explains the Russian propaganda model's surprising success. EXPERT INSIGHTS لﯾطﺎﺑﻷا موطرﺧ \" : ّﻲﺳورﻟا ﺔﯾﺎﻋدﻟا جذوﻣﻧ \" .ﻲﺳوﺮﻟا ﺔﯾﺎﻋﺪﻟا جذﻮﻤﻨﻟ ﻞھﺬﻤﻟا حﺎﺠﻨﻟا ﻰﻟإ تدأ ﻲﺘﻟا ﺔﻟﺎﻌﻔﻟا قﺮﻄﻟا ﺲﻔﻨﻟا RESEARCH China's Evolving Approach to \"Integrated Strategic Deterrence\" This report finds that China's strategic-deterrence concepts are evolving in response to a changing assessment of its external security environment and a growing emphasis on protecting its emerging interests in space and cyberspace. RESEARCH \" لﻣﺎﻛﺗﻣﻟا ﻲﺟﯾﺗارﺗﺳﻻا عدرﻟا \" ءازإ روطﺗﻣﻟا نﯾﺻﻟا ﺞﮭﻧ ﺔﺑﺎﺠﺘﺳا ﻚﻟذو رﻮﻄﺘﻟا ﻲﻓ ةﺬﺧآ ﻦﯿﺼﻟا ﻲﻓ ﻲﺠﯿﺗاﺮﺘﺳﻻا عدﺮﻟا ﻢﯿھﺎﻔﻣ نأ ﺔﺳارﺪﻟا هﺬھ ﺢﺿﻮﺗ ﺎﮭﺤﻟﺎﺼﻣ ﺔﯾﺎﻤﺣ ﻰﻠﻋ ﻲﻣﺎﻨﺘﻤﻟا ﺰﯿﻛﺮﺘﻟاو ﺔﯿﺟرﺎﺨﻟا ﺔﯿﻨﻣﻷا ﺔﺌﯿﺒﻟا ﻢﯿﯿﻘﺗ ﻲﻓ ظﻮﺤﻠﻤﻟا ﺮﯿﯿﻐﺘﻠﻟ .ﻲﻧوﺮﺘﻜﻟﻹا ءﺎﻀﻔﻟاو ءﺎﻀﻔﻟا ﻲﻓ ةﺪﯾاﺰﺘﻤﻟا COMMENTARY Inciting Peace Malicious ideas, ideologies, and narratives (such as those promoted by ISIS) cannot just be eliminated — they need to be replaced. 8/11 10/13/25, 2:58 PM Information Operations | RAND EXPERT INSIGHTS Unconventional Options for the Defense of the Baltic States: The Swiss Approach This RAND perspective outlines the Cold War-era Swiss approach to decentralized resistance against invasion and discusses how it may be of use in the context of the current potential threats to the Baltic states of Estonia, Latvia, and Lithuania. EXPERT INSIGHTS Information Operations: The Imperative of Doctrine Harmonization and Measures of Effectiveness operations (IO) in Afghanistan, this paper describes the continuing challenges of IO doctrine integration and harmonization and the establishment of measures of effectiveness for IO. COMMENTARY Loose Clicks Sink Ships: When Social Media Meets Military Intelligence Social media updates can reveal military intelligence. But stopping a soldier from posting a geotagged tweet or Instagram photo presents challenges. RESEARCH Assessing and Evaluating DoD Inform, Influence, and Persuade Efforts: Guidance for Practitioners The Most Informative Results for DoD IIP Efforts Come from the Intersection of Academic Evaluation and Public Communications. RESEARCH Ensuring U.S. Air Force Operations During Cyber Attacks Against Combat Support Systems: Guidance for Where to Focus Mitigation Efforts RAND researchers developed a process for prioritizing functions and information systems in assessing mission assurance under cyber attack, a challenge due to the number of systems, range of vulnerabilities, and variety of combat support functions. 9/11 10/13/25, 2:58 PM Information Operations | RAND RESEARCH Prediction of Political Action by Means of Propaganda Analysis A study to determine an opponent's initiatives through analysis of his propaganda. RESEARCH Assessing and Evaluating Department of Defense Efforts to Inform, Influence, and Persuade: Desk Reference The U.S. Department of Defense has struggled to assess the progress and effectiveness of its information operations. Best practices across sectors can guide the assessment of these activities and ensure that they help meet national security goals. RESEARCH Assessing and Evaluating Department of Defense Efforts to Inform, Influence, and Persuade: Handbook for Practitioners This handbook compiles strong assessment practices and examples from a range of sectors in an easy-to-navigate format for personnel responsible for planning and assessing inform, influence, and persuade efforts in the U.S. Department of Defense. RESEARCH Assessing and Evaluating Department of Defense Efforts to Inform, Influence, and Persuade: An Annotated Reading List To help broaden the expertise of U.S. Department of Defense assessment personnel and stakeholders, RAND produced a reading list for self-study in best assessment practices across a range of sectors. RESEARCH Integrating Apples, Oranges, Pianos, Volkswagens, and Skyscrapers: On the Relationships Between Information-Related Capabilities and Other Lines of Operation This article describes the various possible relationships between IRCs and the capabilities of other lines of operation. 10/11 10/13/25, 2:58 PM Information Operations | RAND COMMENTARY Why 'Big Data' Can't Find the Missing Malaysian Plane The failure to find the missing aircraft demonstrates anew the serious gaps in data coordination and challenges public assumptions about the thoroughness and simplicity of searching the world’s data for answers. RESEARCH Redefining Information Warfare Boundaries for an Army in a Wireless World The U.S. Army is studying ways to apply its cyber power and is reconsidering doctrinally defined areas related to cyberspace operations. Clarifying the overlap between network and information operations and other areas could inform Army doctrine. PRESS U.S. Military's Efforts to Influence Afghan Population Have Grown Less Effective Over Time The efforts of U.S. military information operations and foreign occupation grew. RESEARCH SUMMARY Assessing Military Information Operations in This research brief offers an overview of the effectiveness of themes were tailored to target audiences. RESEARCH U.S. Military Information Operations in Afghanistan: Effectiveness of Psychological This book evaluates the effectiveness of the psychological operations element of U.S. military information operations messages and themes are tailored to target audiences. RESEARCH SUMMARY Addressing Commanders' Needs for Information on \"Soft\" Factors Describes a framework for thinking about commanders' critical information needs in countersurgency operations and offers practical ways for commanders to integrate influence activities into combined arms planning and assessment. 2/10 https://www.rand.org/topics/information-operations.html?rows=48&start=240#topicLandingPageList-1165855063-form 10/13/25, 2:58 PM Information Operations | RAND COMMENTARY Psychological Operations by Another Name Are Sweeter The Department of Defense has decided to change the name of military psychological operations (PSYOP) and this is a good thing, writes Christopher Paul. RESEARCH Victory Has a Thousand Fathers: Detailed Counterinsurgency Case Studies Narratives on the 30 most recent resolved insurgencies, hypothesized to be related to the success of counterinsurgency forces supplement analyses of historical and contemporary insurgencies. RESEARCH Victory Has a Thousand Fathers: Sources of Success in Counterinsurgency An examination of approaches to counterinsurgency from 30 recent resolved campaigns reveals that good COIN practices tend to 'run in packs' and that the balance of selected good and bad practices perfectly predicts the outcome of a conflict. RESEARCH Understanding Commanders' Information Needs for Influence Operations Describes a study aimed at understanding commanders' information requirements for 'soft' factors to improve combined arms operations' efficacy and develop ways to integrate information and influence operations into combined arms planning/assessment. RESEARCH Foundations of Effective Influence Operations: A Framework for Enhancing Army Capabilities Aims to assist the U.S. Army in understanding RESEARCH Assessing Irregular Warfare: A Framework for Intelligence Analysis Provides an analytic framework and procedure for the intelligence analysis of irregular warfare (IW) environments that can serve as the basis for a subsequent IW intelligence analysis curriculum development effort. 3/10 https://www.rand.org/topics/information-operations.html?rows=48&start=240#topicLandingPageList-1165855063-form 10/13/25, 2:58 PM Information Operations | RAND RESEARCH Integrating Instruments of Power and Influence: Lessons Learned and Best Practices This project involved senior practitioners from several institutions and disciplines to determine best practices for integrating civilian and military intervention activities, drawing on lessons learned from Bosnia, Kosovo, Iraq, and Afghanistan. EXPERT INSIGHTS Doctrine of Eternal Recurrence -- The U.S. Military and Counterinsurgency Doctrine, Counterinsurgency Study -- Paper 6 This paper tests and ultimately disproves the assumption that doctrine as written and operations as conducted are tightly linked. Ingrained organizational concepts and beliefs have a much greater influence on operations than written doctrine. RESEARCH SUMMARY Conducting Counterinsurgency Operations: This research brief examines U.S. counterinsurgency to protect Iraqi civilians; implications for future conflicts; and recommends steps to improve U.S. counterinsurgency capabilities. RESEARCH SUMMARY Applying Madison Avenue Principles and Recent Operational Experience to Counterinsurgency and Stability Operations This research brief summarizes a study that examined successes from the commercial marketing industry and how those lessons might assist U.S. and coalition forces to improve shaping campaigns during stability operations. RESEARCH SUMMARY Counterinsurgency Operations May Require Modernization of the U.S. Airlift Fleet This research brief looks at the role of airlift in U.S. counterinsurgency operations and the types of investment in new airlift assets that may be needed to meet the unique challenges of these operations. 4/10 https://www.rand.org/topics/information-operations.html?rows=48&start=240#topicLandingPageList-1165855063-form 10/13/25, 2:58 PM Information Operations | RAND RESEARCH ''People Make the City,'' Executive Summary: Joint Urban Operations Observations and Insights from Afghanistan and Iraq Reveals lessons that will better enable military and civilian alike to meet national policy objectives by more effectively conducting urban combat and restoration. RESEARCH Al Qaeda and Its Affiliates: A Global Tribe Waging Segmental Warfare Because Al Qaeda and its affiliates operate much like a global tribe, this paper describes the dynamics of classic tribes: what drives them, how they organize, and how they fight. RESEARCH Ignoring the Innocent: Non-combatants in Urban Operations and in Military Models and Simulations Identifies noncombatant behavior from recent military urban operations that has affected the U.S. military's ability to meet objectives during warfare, incorporating information on noncombatants into models and training scenarios, and recommending a layer COMMENTARY Lessons for Intelligence in the Campaign Against al Qaeda Published commentary by RAND staff: Lessons for Intelligence in the Campaign Against al Qaeda, in Vanguard magazine. RESEARCH Understanding and Preparing for the Psychological Consequences of Terrorism Describes the psychological consequences of terrorism and outlinesstrategies for dealing with them. COMMENTARY War, Propaganda and Public Opinion Published commentary by RAND staff: War, Propaganda and Public Opinion in the Balitmore Sun. COMMENTARY Strategy: Political Warfare Neglected Published commentary by RAND staff. 5/10 https://www.rand.org/topics/information-operations.html?rows=48&start=240#topicLandingPageList-1165855063-form 10/13/25, 2:58 PM Information Operations | RAND RESEARCH Information Sharing Among Military Headquarters: The Effects on Decisionmaking Proposes theoretical method to assess the effects of information gathering and collaboration across an information network on military decisions taken by a group of local decisionmakers. RESEARCH SUMMARY Counterterrorism Coalitions: How Should the United States Engage Europe? Studied the counterterrorism capabilities of key European countries, NATO, and the EU to determine whether the United States should seek bilateral or multilateral cooperation in certain areas. RESEARCH Deterrence and Influence in Counterterrorism: A Component in the War on al Qaeda The U.S. counterterrorism strategy should include political warfare, placing at risk things the terrorists hold dear, a credible threat of force against states or groups that support acquisition of weapons of mass destruction, and maintaining cooperation with other nations engaged in the war on terror. RESEARCH Measures of Effectiveness for the Information-Age Navy: The Effects of Network-Centric Operations on Combat Outcomes This report creates a framework for developing measures to help the Navy decide how network-centric operations affect combat outcomes and which information systems work best. RESEARCH Street Smart: Intelligence Preparation of the Battlefield for Urban Operations Offers enhancements to the intelligence preparation of the battlefield (IPB) process to improve its usefulness for urban operations. 6/10 https://www.rand.org/topics/information-operations.html?rows=48&start=240#topicLandingPageList-1165855063-form 10/13/25, 2:58 PM Information Operations | RAND RESEARCH Information Operations and Counterterrorism There is an increasing awareness that TTOs and other asymmetric enemies seek to exploit Western vulnerabilities to cyberbased information operations. COMMENTARY Intelligence in the Information Age; Spy Data For Sale Published commentary by RAND staff. RESEARCH Army After Next Study Cycle Discuss issues that emerged from the games on Army Special Operations, Army Medical Department, Information Operations, Space, Force Projection, National Security, Campaign Planning, Pre-Assessment, and the Spring Wargame. RESEARCH Measures of Effectiveness for the Information-Age Army This research demonstrates that development of measures of effectiveness (MOEs) is feasible, not only for combat operations but for stability operations as well. RESEARCH Technology Acquisition by Terrorist Groups: Threat Assessment Informed by Lessons from Private Sector Technology Adoption Brings to bear the deep literature that exists on technology adoption by commercial organizations to examine the process through which terrorist groups seek out and deploy new technology. RESEARCH Heavy Matter: Urban Operations' Density of Challenges This study proposes a new way of viewing urban operations, among the most complex challenges facing America's armed forces. 7/10 https://www.rand.org/topics/information-operations.html?rows=48&start=240#topicLandingPageList-1165855063-form 10/13/25, 2:58 PM Information Operations | RAND RESEARCH The City's Many Faces: Proccedings of the RAND Arroyo-MCWL-J8 UWG Urban The event sought to provide a forum for information exchange and debate on the complete range of possible urban operations likely to challenge U.S. national interests in the next generation. RESEARCH Securing the U.S. Defense Information Infrastructure: A Proposed Approach The authors analyze the concept of a minimum essential information infrastructure (MEII) in light of the characteristics of the national information infrastructure and the nature of various types of information warfare attacks. RESEARCH Strategic Appraisal: The Changing Role of Information in Warfare This report draws on the expertise of researchers from across RAND to explore the opportunities and vulnerabilities inherent in the increasing reliance on information technology, looking both at its usefulness to the warrior and the need to protect its usefulness for everyone. RESEARCH The Emergence of Noopolitik: Toward An American Information Strategy Discusses the opportunities that may be raised by noopolitik —an emerging form of statecraft that emphasizes the importance of sharing ideas and values globally, principally through the exercise of persuasive soft power rather than traditional military hard power. RESEARCH To Find, and Not to Yield: How Advances in Information and Firepower Can Transform Theater Warfare Absent significant changes in U.S. defense investment priorities, American forces could soon find themselves unable to cope with some emerging challenges in large-scale power projection operations. 8/10 https://www.rand.org/topics/information-operations.html?rows=48&start=240#topicLandingPageList-1165855063-form 10/13/25, 2:58 PM Information Operations | RAND RESEARCH Strategic Information Warfare Rising Strategic Information Warfare (SIW) lies at the intersection of the information revolution and the ongoing revolution in strategic warfare. RESEARCH National security in the information age National security in the information age RESEARCH SUMMARY How Advances in Information and Firepower Can Transform Warfare Investigated the potential of new concepts for destroying moving mechanized forces. These new concepts incorporate advanced munitions with systems for theaterwide surveillance and control. RESEARCH SUMMARY Sources of Future Conflict: Long-Range Security Implications of Key Regional and Global Trends Examines several alternative strategic worlds and what they might mean for the United States and for U.S. Air Force planners. RESEARCH Space: Emerging Options for National Power Presents the results of a study that examined the extent to which both military and economic spacepower will influence national security strategy and the conduct of future military operations. RESEARCH Interagency Coordination in Military Operations Other Than War: Implications for the U.S. Army The Arroyo Center is researching ways for the U.S. Army to maximize its effectiveness and efficiency in interagency military operations other than war (MOOTW). RESEARCH In Athena’s Camp: Preparing for Conflict in the Information Age The information revolution is transforming the nature of conflict across the spectrum: from open warfare, to terrorism, crime, and even radical social activism. 9/10 https://www.rand.org/topics/information-operations.html?rows=48&start=240#topicLandingPageList-1165855063-form 10/13/25, 2:58 PM Information Operations | RAND EXPERT INSIGHTS Bettering the Balance: Large Wars and Small Contingencies This paper explores the Army's options: using contractors; relying on the reserves; redesigning existing organizations; improving routine training; reducing equipment problems; and improving its information operations. RESEARCH SUMMARY The U.S. Air Force and Operations Other Than War: Reducing Current Stresses and Meeting Future Demand Study of USAF involvement in military operations other than war delineates the challenges facing the USAF at this optempo level and offers new approaches aimed not only at minimizing existing problems but also at enhancing USAF MOOTW capabilities. EXPERT INSIGHTS Information War and the Air Force: Wave of the Future? Current Fad? The Air Force's priorities for waging war in the information age should be on integrating systems into RESEARCH SUMMARY Strategic War ... in Cyberspace In short, there will exist the capability for strategic information warfare. RESEARCH Psychological Effects of U.S. Air Operations Commanders This report examines ways to maximize the psychological impact of U.S. air power in future conflicts. RESEARCH Strategic Information Warfare: A New Face of War Future U.S. national security strategy is likely to be profoundly affected by the ongoing, rapid evolution of cyberspace -- the global information infrastructure. RESEARCH Information Technologies and the Future of Land Warfare Much of the future of land warfare will be shaped by the rapidly expanding information technologies. RESEARCH SUMMARY The Fly on the Wall and the Jedi Knight To identify leading-edge technologies that could revolutionize military operations, to develop concepts of military systems that could transform warfare, and to specify the research necessary to make these systems a reality. Finding a New Approach to Measure the Operational Value of Intelligence for Military Operations: Annotated Briefing Documents the final executive-level briefing for a project whose goal was to develop and apply innovative analytic tools for quantifying the operational value of intelligence, electronic warfare/target acquisition (IEW/TA). 2/4 https://www.rand.org/topics/information-operations.html?rows=48&start=288#topicLandingPageList-1165855063-form 10/13/25, 2:59 PM Information Operations | RAND Methodological Considerations in Using Simulation to Assess the Combat Value of Intelligence and Electronic Warfare ... technical challenges that must be addressed to support the analysis of the combat value of intelligence and electronic warfare/target acquisition (IEW/TA) with simulation models. This Note describes these challenges and considers ways to meet them. Underground Voices: Insurgent Propaganda in El Salvador, Nicaragua, and Peru Examines some of the ways in which guerrilla groups in El Salvador, Nicaragua, and Peru influence their supporters and potential supporters with propaganda. RESEARCH A Simple Model To Elucidate the Utility of Weather Forecasting in Military Operations: Weather and Warplanes III A simple model is constructed to demonstrate the influence of weather forecasts on operational decisions. RESEARCH The Enclave: Some U.S. Military Efforts in Ly A personal account of some American tactical operations in draws implications about the effectiveness of enclave deployment. RESEARCH Winning the Hearts and Minds of the People: This Memorandum concerns the campaign of public information, civic action, and other persuasive measures by which the government won the crucially important support of the populace in the British campaign against the communist terrorists in Malaya. EXPERT INSIGHTS The Role of Airpower in Providing Tactical Mobility in Past COIN Operations An abstract of information developed in an unclassified symposium, \"The Role of Airpower in Counterinsurgency and Unconventional Warfare,\" held at the Rand Washington 3/4 https://www.rand.org/topics/information-operations.html?rows=48&start=288#topicLandingPageList-1165855063-form 10/13/25, 2:59 PM Information Operations | RAND RESEARCH On Relevance, Probabilistic Indexing and Information Retrieval This paper reports on a novel technique for literature indexing and searching in a mechanized library system. RESEARCH The Psychological Factor in Soviet Foreign Policy A study of the implications of Stalin's death for changing the motivation of Soviet foreign policy.", "category": ""}
{"title": "Information Operations RAND Dataset", "date": "", "summary": "Information operations and warfare, also known as influence operations, includes the collection of tactical information about an adversary as well as the dissemination of propaganda in pursuit of a competitive advantage over an opponent. RAND research has enabled military leaders and policymakers to develop strategies and policy frameworks to address the challenges of these military operations.  EXPLORE RAND’S WORK ON THIS TOPIC Related Topics Military Information Technology Systems Psychological Warfare Warfare and Military Operations", "category": ""}